app/controllers/client_info_controller.rb

  def index
    # パラメータから会社IDを取得
    client_id = params['client_id']

    # 取得した会社IDがユーザの顧客であるかを確認
    if !@client_info_service.is_users_client(@user_id, client_id)
      raise "invalid company is searched. user_id is #{user_id}"
    end

    @client_info_form.client = MClient.find_by(id: client_id)
---
SELECT  `m_clients`.* FROM `m_clients` WHERE `m_clients`.`id` = 1 LIMIT 1