app/controllers/csv_import_controller.rb

SELECT  `m_users`.* FROM `m_users` WHERE `m_users`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `m_clients` WHERE `m_clients`.`id` = 1 AND `m_clients`.`m_company_id` = 1
---
  def import
    # CSV読込データ
    csv_file = params['file']
    client_id = params['client']['id']

    # ログインユーザの情報を取得
    user = MUser.find(@user_id)
    company_id = user.m_company_id

    # クライアントデータバリデーション
    count = MClient.where(id: client_id, m_company_id: company_id).size

SELECT `m_clients`.`id`, `m_clients`.`client_nm` FROM `m_clients` WHERE `m_clients`.`m_company_id` IN (SELECT `m_users`.`m_company_id` FROM `m_users` WHERE `m_users`.`id` = 1)
---
  def set_client_list
    # ユーザの会社ID情報の取得
    company_id = MUser.where(id: @user_id).select(:m_company_id)
    # クライアント情報の取得
    clients = MClient.where(m_company_id: company_id).select(:id, :client_nm)