app/controllers/home_controller.rb

  def index
    # 顧客情報取得
    company = MCompany.joins(:m_users).where(m_users: {id: @user_id})
    # クライアントリスト取得
    @home_form.client_list = MClient.where(m_company_id: company)
---
SELECT `m_clients`.* FROM `m_clients` WHERE `m_clients`.`m_company_id` IN (SELECT `m_companies`.`id` FROM `m_companies` INNER JOIN `m_users` ON `m_users`.`m_company_id` = `m_companies`.`id` WHERE `m_users`.`id` = 1)